# Format:
#   package
#   package if:FLAG_NAME
#   package optional
#   package if:FLAG_NAME optional
#   $VARIABLE_NAME
#   $VARIABLE_NAME if:FLAG_NAME

# Base / quality-of-life
base-devel
git
curl
wget
linux-firmware
amd-ucode
nano
vim
neovim
zsh
openssh
rsync
unzip
zip
p7zip
unrar
jq
yq
pacman-contrib
man-db
man-pages
bash-completion
reflector
fwupd
lm_sensors
acpi
htop
btop
fastfetch
ripgrep
fd
bat
eza
fzf
tmux
chrony

# Filesystems / removable media
exfatprogs
dosfstools
ntfs-3g
gvfs
gvfs-mtp
gvfs-smb

# Desktop: GDM + GNOME core + Hyprland
gdm
gnome-shell
gnome-session
gnome-settings-daemon
gnome-control-center
gnome-keyring
nautilus
xdg-desktop-portal
xdg-desktop-portal-gnome
hyprland
xdg-desktop-portal-hyprland
hyprlock
waybar
wofi
dunst
kitty
cava
swww
cliphist
grim
slurp
swappy
wl-clipboard
libnotify
brightnessctl
playerctl
networkmanager
network-manager-applet
nm-connection-editor
power-profiles-daemon
ttf-jetbrains-mono-nerd
polkit-gnome
qt6-wayland
qt5-wayland

# NVIDIA + Wayland essentials
mesa
lib32-mesa
vulkan-icd-loader
lib32-vulkan-icd-loader
vulkan-tools
$NVIDIA_DRIVER_PKG
nvidia-utils
lib32-nvidia-utils
nvidia-settings
opencl-nvidia
egl-wayland
libva-nvidia-driver

# ASUS laptop tools (optional)
asusctl if:INSTALL_ASUS_TOOLS
rog-control-center if:INSTALL_ASUS_TOOLS optional
supergfxctl if:INSTALL_SUPERGFXCTL

# Audio
pipewire
wireplumber
pipewire-alsa
pipewire-pulse
alsa-utils
sof-firmware
pavucontrol

# Gaming stack
steam
wine-staging
winetricks
lutris
gamemode
lib32-gamemode
mangohud
lib32-mangohud
gamescope
goverlay
obs-studio

# Programming / dev stack
gcc
clang
lld
lldb
gdb
cmake
ninja
make
pkgconf
python
python-pip
python-virtualenv
pipx
nodejs
npm
go
rustup
jdk-openjdk
maven
gradle
shellcheck
shfmt
sqlite
postgresql-libs
direnv
wireshark-cli
git-lfs
vscode optional

# Optional stacks
docker if:INSTALL_DOCKER
docker-compose if:INSTALL_DOCKER
qemu-full if:INSTALL_VIRT
virt-manager if:INSTALL_VIRT
libvirt if:INSTALL_VIRT
dnsmasq if:INSTALL_VIRT
vde2 if:INSTALL_VIRT
ebtables if:INSTALL_VIRT
iptables-nft if:INSTALL_VIRT

# School / productivity
libreoffice-fresh
gimp
inkscape
blender
pandoc
texinfo
anki
krita
keepassxc
texlive-most if:INSTALL_LATEX
biber if:INSTALL_LATEX

# Flatpak dependency
flatpak if:INSTALL_FLATPAK
