git
base-devel
go
curl
nano
pacman-contrib
flatpak
sudo
networkmanager
network-manager-applet
zsh
ly
plymouth
sbctl
hyprland
wofi
waybar
kitty
ttf-jetbrains-mono-nerd
swaync
awww
libnotify
hypridle
gnome-keyring
brightnessctl
wl-clipboard
grim
slurp
steam


noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
ttf-jetbrains-mono
ttf-dejavu
ttf-liberation
inter-font
adobe-source-han-sans-otc-fonts
adobe-source-han-serif-otc-fonts
woff2-font-awesome